#일반적 방법[sqlite]

In [9]:
import sqlite3

conn = sqlite3.connect('chinook.db')

c = conn.cursor()

query = '''
SELECT *
FROM albums
'''

c.execute(query)

In [ ]:
c.fetchall()

In [ ]:
c.close()
conn.close()

#판다스로 가져오기

In [12]:
import sqlite3
import pandas as pd

conn = sqlite3.connect('chinook.db')

c = conn.cursor()

query = '''
SELECT *
FROM albums
'''

df = pd.read_sql(query, conn)
df.head()

   AlbumId                                  Title  ArtistId
0        1  For Those About To Rock We Salute You         1
1        2                      Balls to the Wall         2
2        3                      Restless and Wild         2
3        4                      Let There Be Rock         1
4        5                               Big Ones         3

In [14]:
!pip install psycopg2-binary
!pip install sqlalchemy

Collecting psycopg2-binary
  Obtaining dependency information for psycopg2-binary from https://files.pythonhosted.org/packages/0e/1d/328ded51096872751727628c54f05953d3288672888178358ef4bdf085b0/psycopg2_binary-2.9.7-cp38-cp38-macosx_11_0_arm64.whl.metadata
  Downloading psycopg2_binary-2.9.7-cp38-cp38-macosx_11_0_arm64.whl.metadata (4.4 kB)
Downloading psycopg2_binary-2.9.7-cp38-cp38-macosx_11_0_arm64.whl (2.5 MB)
   ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 2.5/2.5 MB 5.8 MB/s eta 0:00:0000:0100:01
Installing collected packages: psycopg2-binary
Successfully installed psycopg2-binary-2.9.7
Requirement already satisfied: sqlalchemy in /Users/seojunebeom/anaconda3/envs/ai2/lib/python3.8/site-packages (2.0.20)
Requirement already satisfied: typing-extensions>=4.2.0 in /Users/seojunebeom/anaconda3/envs/ai2/lib/python3.8/site-packages (from sqlalchemy) (4.7.1)

In [21]:
import psycopg2

db_params = {
    "host": 'localhost',
    'database': 'postgres',
    'user': 'postgres',
    'password': '0000',
    'port': '5432'
}

In [32]:
try:
    conn = psycopg2.connect(**db_params)
    cursor = conn.cursor()
    print('데이터베이스 연결 성공')

    #테이블 만들기
    create_table_query='CREATE TABLE IF NOT EXISTS example_table(id SERIAL PRIMARY KEY, data VARCHAR)'
    insert_data_query="INSERT INTO example_table (data) VALUES ('HI')"
    #테이블 만든 후 실행
    cursor.execute(create_table_query)
    cursor.execute(insert_data_query)

    #테이블 내보내기(커밋)
    conn.commit()

    read_data_query = 'SELECT * FROM example_table'
    cursor.execute(read_data_query)
    print(cursor.fetchall())
    print('테이블 생성 완료')

except(Exception, psycopg2.Error) as error:
    print(error)

finally:
    if conn:
        conn.close()
        print('데이터베이스 연결 종료')

데이터베이스 연결 성공
[(1, 'HI'), (2, 'HI'), (3, 'HI'), (4, 'HI'), (5, 'HI')]
테이블 생성 완료
데이터베이스 연결 종료

In [46]:
import psycopg2

db_elephant = {
    "host": 'floppy.db.elephantsql.com',
    'database': 'vgkkoxqw',
    'user': 'vgkkoxqw',
    'password': 'NcGCrHZaUkcooNsc7dS9NzKEUL-O7tSl',
    'port': '5432'
}

In [47]:

try:
    conn = psycopg2.connect(**db_elephant)
    cursor = conn.cursor()
    print('데이터베이스 연결 성공')

    read_data_query = 'SELECT * FROM example_table'
    cursor.execute(read_data_query)
    print(cursor.fetchall())
    print('테이블 생성 완료')

except(Exception, psycopg2.Error) as error:
    print(error)

finally:
    if conn:
        conn.close()
        print('데이터베이스 연결 종료')

데이터베이스 연결 성공
[(1, 'HI'), (2, 'HI'), (3, 'HI'), (4, 'HI'), (5, 'HI')]
테이블 생성 완료
데이터베이스 연결 종료

In [53]:
import psycopg2
from sqlalchemy import create_engine
db_elephant = {
    "host": 'floppy.db.elephantsql.com',
    'database': 'vgkkoxqw',
    'user': 'vgkkoxqw',
    'password': 'NcGCrHZaUkcooNsc7dS9NzKEUL-O7tSl',
    'port': '5432'
}

try:
    conn = psycopg2.connect(**db_elephant)
    cursor = conn.cursor()
    engine = create_engine('postgresql://vgkkoxqw:NcGCrHZaUkcooNsc7dS9NzKEUL-O7tSl@floppy.db.elephantsql.com/vgkkoxqw')
    print('데이터베이스 연결 성공')
    with engine.connect() as con:
        df.to_sql('aapl', con, if_exists='replace')
        
except(Exception, psycopg2.Error) as error:
    print(error)

finally:
    if conn:
        conn.close()
        print('데이터베이스 연결 종료')

데이터베이스 연결 성공
(psycopg2.OperationalError) connection to server at "floppy.db.elephantsql.com" (54.178.151.252), port 5432 failed: FATAL:  too many connections for role "vgkkoxqw"

(Background on this error at: https://sqlalche.me/e/20/e3q8)
데이터베이스 연결 종료

In [65]:
import psycopg2
from sqlalchemy import create_engine
db_elephant = {
    "host": 'floppy.db.elephantsql.com',
    'database': 'vgkkoxqw',
    'user': 'vgkkoxqw',
    'password': 'NcGCrHZaUkcooNsc7dS9NzKEUL-O7tSl',
    'port': '5432'
}

try:
    conn = psycopg2.connect(**db_elephant)
    cursor = conn.cursor()
    engine = create_engine('postgresql://vgkkoxqw:NcGCrHZaUkcooNsc7dS9NzKEUL-O7tSl@floppy.db.elephantsql.com/vgkkoxqw')
    print('데이터베이스 연결 성공')
    with engine.connect() as con:
        #sql 가져오기
        aapl = pd.read_sql('SELECT * FROM aapl', con)
        
except(Exception, psycopg2.Error) as error:
    print(error)

finally:
    if conn:
        conn.close()
        print('데이터베이스 연결 종료')

데이터베이스 연결 성공
데이터베이스 연결 종료

In [66]:
aapl.head()

,index,Date,Open,High,Low,Close,Adj Close,Volume
0,0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600
3,3,2012-01-06,14.991786,15.098214,14.972143,15.085714,12.804703,318292800
4,4,2012-01-09,15.196429,15.276786,15.048214,15.061786,12.784389,394024400

In [48]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/jin0choi1216/dataset/main/AAPL.csv')
df.head(3)

,Date,Open,High,Low,Close,Adj Close,Volume
0,2012-01-03,14.621429,14.732143,14.607143,14.686786,12.466090,302220800
1,2012-01-04,14.642857,14.810000,14.617143,14.765714,12.533089,260022000
2,2012-01-05,14.819643,14.948214,14.738214,14.929643,12.672229,271269600